; domain
(define (domain disnet)
  (:requirements :typing :equality :fluents :conditional-effects)
  (:types
    primary secondary - substation)
  (:predicates
    (available ?x - substation)
    (full ?x - substation)    
    (open_line ?dirdep - substation ?dirarr - substation)
    (closed ?x - substation ?y - substation)
    (connected ?x - substation ?y - substation)
    (buildable ?x - substation ?y - substation)
    (mutable ?x - substation)
    (removed ?x - substation ?y - substation)
    (feed ?x - substation ?y - substation)
    (is-primary ?x - substation)
  ) 

   (:action change_switch_connection
    :parameters (?s1 - secondary ?s2 - substation ?s3 - substation)
    :precondition (and 
        (open_line ?s1 ?s2)
        (closed ?s1 ?s3)
        (not(feed ?s3 ?s1))
        (feed ?s1 ?s3)
        (not(= ?s1 ?s2))       
        (not(= ?s1 ?s3))
        (not(= ?s2 ?s3))       
        )
    :effect (and (not(open_line ?s1 ?s2))
        (not(open_line ?s2 ?s1))
        (not (closed ?s1 ?s3))
        (not (closed ?s3 ?s1))
        (not(feed ?s1 ?s3))
        (feed ?s1 ?s2)
        (open_line ?s1 ?s3)
        (open_line ?s3 ?s1)
        (closed ?s1 ?s2)
        (closed ?s2 ?s1)))

  (:action add_openLine
    :parameters (?s1 - substation ?s2 - substation)
    :precondition (and
        (or (available ?s1)
            (is-primary ?s1))
        (or (available ?s2)
            (is-primary ?s2))
        (buildable ?s1 ?s2)
        (mutable ?s1) 
        (mutable ?s2)
        (not(and(is-primary ?s1)
            (is-primary ?s2))
        )
        (not(= ?s1 ?s2)))
    :effect (and 
        (not(buildable ?s1 ?s2))
        (not(buildable ?s2 ?s1))
        (not(available ?s1))
        (not(available ?s2))
        (when
        ;Antecedent
        (not(is-primary ?s1))
        ;Consequence
        (and (full ?s1))
        )
        (when
        ;Antecedent
        (not(is-primary ?s2))
        ;Consequence
        (and (full ?s2))
        )
        (open_line ?s1 ?s2)
        (open_line ?s2 ?s1)
        (connected ?s1 ?s2)
        (connected ?s2 ?s1)
        ))

  (:action remove_add_openLine
    :parameters (?s1 - secondary ?s2 - secondary ?s3 - substation)
    :precondition (and 
        (open_line ?s1 ?s2)
        (full ?s1)
        (or (available ?s3)
            (is-primary ?s3))
        (mutable ?s1)
        (mutable ?s2)
        (mutable ?s3)
        (buildable ?s2 ?s3)
        (not(= ?s1 ?s2))       
        (not(= ?s1 ?s3))
        (not(= ?s2 ?s3))
        )
    :effect (and (not(open_line ?s1 ?s2))
        (not(open_line ?s2 ?s1))
        (not(connected ?s1 ?s2))
        (not(connected ?s2 ?s1))
        (not(buildable ?s2 ?s3))
        (not(buildable ?s3 ?s2))
        (not(available ?s3))
        (not(full ?s1))
        (available ?s1)
        (full ?s3)
        (open_line ?s2 ?s3)
        (open_line ?s3 ?s2)
        (connected ?s2 ?s3)
        (connected ?s3 ?s2)
        (removed ?s1 ?s2)
        (removed ?s2 ?s1)
        ))

(:action remove_openLine
    :parameters (?s1 - substation ?s2 - substation)
    :precondition (and 
        (open_line ?s1 ?s2)
        (or (full ?s1)
            (is-primary ?s1))
        (or (full ?s2)
            (is-primary ?s2))
        (mutable ?s1)
        (mutable ?s2)
        )
    :effect (and (not(open_line ?s1 ?s2))
        (not(open_line ?s2 ?s1))
        (not(connected ?s1 ?s2))
        (not(connected ?s2 ?s1))
        (not(full ?s1))
        (not(full ?s2))
        (available ?s1)
        (available ?s2)
        (removed ?s1 ?s2)
        (removed ?s2 ?s1)
        ))
 )

; problem
(define (problem disnet6n) (:domain disnet)
(:objects
	P7 P8 - Primary
	S1 S2 S3 S4 S5 S6 - Secondary
	)
(:init
	(is-primary P7)
	(is-primary P8)
	(connected P7 S1)(connected S1 P7)
	(feed S1 P7)
	(closed P7 S1)(closed S1 P7)
	(connected S2 P8)(connected P8 S2)
	(feed P8 S2)
	(closed S2 P8)(closed P8 S2)
	(connected P7 S3)(connected S3 P7)
	(feed S3 P7)
	(closed P7 S3)(closed S3 P7)
	(connected S3 S4) (connected S4 S3)
	(feed S4 S3)
	(closed S3 S4) (closed S4 S3)
	(connected S5 S6) (connected S6 S5)
	(feed S6 S5)
	(closed S5 S6) (closed S6 S5)
	(connected S6 P8)(connected P8 S6)
	(feed P8 S6)
	(closed S6 P8)(closed P8 S6)
	(connected P7 S1)(connected S1 P7)
	(feed S1 P7)
	(open_line P7 S1)(open_line S1 P7)
	(connected S2 P8)(connected P8 S2)
	(feed P8 S2)
	(open_line S2 P8)(open_line P8 S2)
	(connected P7 S3)(connected S3 P7)
	(feed S3 P7)
	(open_line P7 S3)(open_line S3 P7)
	(connected P7 S4)(connected S4 P7)
	(feed S4 P7)
	(open_line P7 S4)(open_line S4 P7)
	(connected S5 P8)(connected P8 S5)
	(feed P8 S5)
	(open_line S5 P8)(open_line P8 S5)
	(connected S6 P8)(connected P8 S6)
	(feed P8 S6)
	(open_line S6 P8)(open_line P8 S6)
	(feed P7 P7)
	(feed P8 P8)
	(available P7)
	(available P8)
	(available S1)
	(available S2)
	(full S3)
	(available S4)
	(available S5)
	(full S6)
	(buildable S4 S1)
	(buildable S1 S4)
	(buildable S2 S4)
	(buildable S4 S2)
	(buildable S5 S3)
	(buildable S3 S5)
	(mutable S1)
	(mutable P7)
	(mutable S4)
	(mutable S2)
	(mutable P8)
	(mutable S3)
	(mutable S5)
	(mutable S6)
	)
(:goal (and
	(connected P7 S1)(connected S1 P7)
	(closed P7 S1)(closed S1 P7)
	(connected S1 S4) (connected S4 S1)
	(closed S1 S4) (closed S4 S1)
	(connected S4 S2) (connected S2 S4)
	(open_line S4 S2) (open_line S2 S4)
	(connected S2 P8)(connected P8 S2)
	(closed S2 P8)(closed P8 S2)
	(connected P7 S3)(connected S3 P7)
	(closed P7 S3)(closed S3 P7)
	(connected S3 S5) (connected S5 S3)
	(open_line S3 S5) (open_line S5 S3)
	(connected S5 S6) (connected S6 S5)
	(closed S5 S6) (closed S6 S5)
	(connected S6 P8)(connected P8 S6)
	(closed S6 P8)(closed P8 S6)
	(removed S4 S3)
	(removed S3 S4)
	(removed S4 P7)
	(removed P7 S4)
	(removed P8 S5)
	(removed S5 P8)
	)
)
)

; plan
1. (add_openline s4 s1)
   deleted: (buildable s4 s1) (buildable s1 s4) (available s4) (available s1)
   added: (full s4) (full s1) (open_line s4 s1) (open_line s1 s4) (connected s4 s1) (connected s1 s4)
   goals met: 22 of 38
2. (remove_openline p7 s4)
   deleted: (open_line p7 s4) (open_line s4 p7) (connected p7 s4) (connected s4 p7) (full s4)
   added: (available s4) (removed p7 s4) (removed s4 p7)
   goals met: 24 of 38
3. (add_openline s4 s2)
   deleted: (buildable s4 s2) (buildable s2 s4) (available s4) (available s2)
   added: (full s4) (full s2) (open_line s4 s2) (open_line s2 s4) (connected s4 s2) (connected s2 s4)
   goals met: 28 of 38
4. (change_switch_connection s4 s1 s3)
   deleted: (open_line s4 s1) (open_line s1 s4) (closed s4 s3) (closed s3 s4) (feed s4 s3)
   added: (feed s4 s1) (open_line s4 s3) (open_line s3 s4) (closed s4 s1) (closed s1 s4)
   goals met: 30 of 38
5. (remove_openline s3 s4)
   deleted: (open_line s3 s4) (open_line s4 s3) (connected s3 s4) (connected s4 s3) (full s3) (full s4)
   added: (available s3) (available s4) (removed s3 s4) (removed s4 s3)
   goals met: 32 of 38
6. (add_openline s5 s3)
   deleted: (buildable s5 s3) (buildable s3 s5) (available s5) (available s3)
   added: (full s5) (full s3) (open_line s5 s3) (open_line s3 s5) (connected s5 s3) (connected s3 s5)
   goals met: 36 of 38
7. (remove_openline s5 p8)
   deleted: (open_line s5 p8) (open_line p8 s5) (connected s5 p8) (connected p8 s5) (full s5)
   added: (available s5) (removed s5 p8) (removed p8 s5)
   goals met: 38 of 38
